Update karolina_wiśniewska.md
